/**************************************************************************************
 * Copyright        : BPUT
 * Author           : hx
 * Date             : 2017.07.21
 * Description      : 启动摄像头 并用Canny算子检测边缘
***************************************************************************************/


//--------------------------【头文件、命名空间包含部分】--------------------------------
//					描述：包含程序所使用的头文件和命名空间
//--------------------------------------------------------------------------------------

#include <opencv2/opencv.hpp>

using namespace cv;

//---------------------------------【主程序】-------------------------------------------
int main ( int argc ,char** argv )
{
	VideoCapture capture(0);
	Mat edges;

	//循环显示每一帧
	while (1)
	{
		//【1】读取图像
		Mat frame;			//定义一个Mat变量，用于储存每一帧图像
		capture >> frame;	//读取当前帧

		//【2】将原图像转换成灰度图像
		cvtColor(frame, edges, CV_BGR2GRAY);	//转化BGR彩色图为灰度图

		//【3】使用3×3内核降噪（2×3+1=7）
		blur( edges, edges,Size(7,7) );

		//【4】进行canny边缘检测并显示
		Canny( edges,edges,0,30,3 );
		imshow("被Canny后的视频", edges);	//显示经过处理后的当前帧
		if (waitKey(30) >= 0) continue;		//延时30ms	此处应用continue跳过本次循环 不应用break跳出while
		
	}
	return 0;

}