/***********************************************************************************
* Copyright   : BUPT
* Author      : hx
* Date        : 2017.07.21
* Description : OpenCV 均值滤波
***********************************************************************************/


//-----------------------【头文件、命名空间包含部分】--------------------------------
//						描述：包含程序所使用的头文件和命名空间
//-----------------------------------------------------------------------------------

#include <opencv2/highgui.hpp>
#include <opencv2/imgproc.hpp>

using namespace cv;


//----------------------------【main（）函数】---------------------------------------
//					描述：控制台应用程序的入口函数，程序从这里开始
//-----------------------------------------------------------------------------------
int main()
{
	//【1】载入原始图
	Mat srcImage = imread("Lenna_Noise.jpg");

	//【2】显示原始图
	imshow( "Lenna_Noise.jpg",srcImage );

	//【3】进行均值滤波操作
	Mat dstImage;
	blur(srcImage, dstImage, Size(3, 3));
	
	//【4】显示效果图
	imshow( "均值滤波【效果图】",dstImage );

	waitKey(0);

}